---
type: AssetPropertyList
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 10
tags: [revit-api, class]
---

# AssetPropertyList

`Autodesk.Revit.DB.Visual.AssetPropertyList` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddNewAssetAsColor | 2018.1 | `public void AddNewAssetAsColor ( Color value )` |
| Method | AddNewAssetPropertyDouble | 2018.1 | `public void AddNewAssetPropertyDouble ( double value )` |
| Method | AddNewAssetPropertyInteger | 2018.1 | `public void AddNewAssetPropertyInteger ( int value )` |
| Method | GetValue | 2014 | `public IList < AssetProperty > GetValue ()` |
| Method | InsertNewAssetAsColor | 2018.1 | `public void InsertNewAssetAsColor ( Color value , int index )` |
| Method | InsertNewAssetPropertyDouble | 2018.1 | `public void InsertNewAssetPropertyDouble ( double value , int index )` |
| Method | InsertNewAssetPropertyInteger | 2018.1 | `public void InsertNewAssetPropertyInteger ( int value , int index )` |
| Method | IsValidValue | 2018.1 | `public bool IsValidValue ( IList < AssetProperty > value )` |
| Method | RemoveAssetProperty | 2018.1 | `public void RemoveAssetProperty ( int index )` |
| Method | SetValue | 2014 | `public void SetValue ( IList < AssetProperty > value )` |